[
    {
        "reviews": [
            {
                "review_header": "SCAM! NO PHONE IN BOX!", 
                "review_text": "DON'T BUY IT THERE IS NO PHONE IN THE BOX!!! REPEAT DO NOT BUY THIS. IT'S FRAUD. THERE IS NO PHONE IN THE BOX! NO PHONE! FRAUD! SCAM!", 
                "review_comment_count": "4", 
                "review_posted_date": "07 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Susan Riccio"
            }, 
            {
                "review_header": "Severly scratched and dented, won't even turned on.", 
                "review_text": "I don't know what they called certified refurbished, but all i received was a severly dented and scratched phone with a new screen. Also, it won't even turn on! DON'T BUY AND WASTE YOUR TIME OR MONEY ON THIS.", 
                "review_comment_count": "", 
                "review_posted_date": "01 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "iPhone 6 with Touch Disease.", 
                "review_text": "Right from the start this \"certified refurbished\" phone was often unresponsive and frequently froze up. The only way to revive it was to do a hard power-off and reboot it, and even that only worked some of the times. I returned the phone and three weeks later got a replacement, which was even worse: I could not even activate it, as it was frozen from the start. Some on-line research has revealed that this problem is common with the iPhone 6: it is a design problem that has been labeled \"Touch Disease\". Apparently the touch chips on the logic board often partially break off and you get intermittent electrical connections. I'll have to take it to an Apple store and see what they can do about it.", 
                "review_comment_count": "1", 
                "review_posted_date": "26 Aug 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Ausonio Marras"
            }, 
            {
                "review_header": "Damaged Phone!!!", 
                "review_text": "The Phone is scraped off and the mic and speakers have a horrible sound while listening to music or watching videos. I don't buy this damaged phone i want a New one.", 
                "review_comment_count": "1", 
                "review_posted_date": "23 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "One Star", 
                "review_text": "box came empty", 
                "review_comment_count": "1", 
                "review_posted_date": "13 May 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "don't waste your time and money on buying this", 
                "review_text": "Not compatible with metro pcs or T-Mobile network,don't waste your time and money on buying this.", 
                "review_comment_count": "", 
                "review_posted_date": "22 Oct 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "the other 6 were good.", 
                "review_text": "Unfortunately, one of the phones I got from you didn't work and I'm constantly being harassed by the buyer for selling them a phone that doesn't work, I had to refund them and bear the loss...the other 6 were good.", 
                "review_comment_count": "", 
                "review_posted_date": "09 Dec 2016", 
                "review_rating": "4.0 ", 
                "review_author": " Mr"
            }, 
            {
                "review_header": "Two Stars", 
                "review_text": "The left side of the touch does not work at times. I am going to return it.", 
                "review_comment_count": "", 
                "review_posted_date": "04 Dec 2016", 
                "review_rating": "2.0 ", 
                "review_author": " desmond watson"
            }
        ], 
        "ratings": {
            "2 star": "8%", 
            "1 star": "31%", 
            "4 star": "15%", 
            "3 star": "5%", 
            "5 star": "41%"
        }, 
        "price": "$284.99", 
        "url": "http://www.amazon.com/dp/B00YD547Q6", 
        "name": "Apple iPhone 6 16GB Factory Unlocked GSM 4G LTE Smartphone, Space Grey (Certified Refurbished)"
    }, 
    {
        "reviews": [
            {
                "review_header": "I gamble on refurbished and I lost.", 
                "review_text": "The outside looked like new. No complaints here. I had to do factory restore a couple of time because it did not want to start. Now that the warranty is expired, the phone is totally dead. I kept the software updated and the battery was charged. What can I say... I'm very disappointed.", 
                "review_comment_count": "1", 
                "review_posted_date": "11 Apr 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Holly-N"
            }, 
            {
                "review_header": "Perfect functions, no mark on the phone", 
                "review_text": "First I was scared to order a refurbished Iphone because of the reviews, but I finally got it and received it as new. Perfect functions, no mark on the phone, I have it since almost one month now and works perfectly.", 
                "review_comment_count": "", 
                "review_posted_date": "10 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "The phone came in today. It worked for a ...", 
                "review_text": "The phone came in today. It worked for a couple of hours and then froze. What am I even supposed to do?", 
                "review_comment_count": "", 
                "review_posted_date": "10 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Erika Constancio"
            }, 
            {
                "review_header": "... about getting a refurbished phone but everything works perfectly fine. Charger had minor problems connecting", 
                "review_text": "Was nervous about getting a refurbished phone but everything works perfectly fine. Charger had minor problems connecting.", 
                "review_comment_count": "", 
                "review_posted_date": "08 Mar 2016", 
                "review_rating": "4.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great product! It came with 3 small scratches on the body, but otherwise perfect condition.", 
                "review_comment_count": "", 
                "review_posted_date": "21 Dec 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Ayn"
            }, 
            {
                "review_header": "The phone arrived in good working order", 
                "review_text": "The phone arrived in good working order. There was a big scratch on the back near the charging port that I would classify as more than normal wear and tear.", 
                "review_comment_count": "", 
                "review_posted_date": "28 Dec 2016", 
                "review_rating": "3.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "AVOID", 
                "review_text": "I ordered the iPhone 6 64 gigabyte and looking through the package, the iPhone is freaking bent. Wasted my time and money. AVOID LIKE HERPES", 
                "review_comment_count": "", 
                "review_posted_date": "28 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " wheredidileavemycell"
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Phone looked brand new. There wasn't any scratches or nothing. It was exactly what I expected!", 
                "review_comment_count": "", 
                "review_posted_date": "04 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Char"
            }
        ], 
        "ratings": {
            "2 star": "2%", 
            "1 star": "34%", 
            "4 star": "15%", 
            "3 star": "6%", 
            "5 star": "43%"
        }, 
        "price": "$364.98", 
        "url": "http://www.amazon.com/dp/B00YD548Q0", 
        "name": "Apple iPhone 6 64GB Unlocked Smartphone - Gold (Certified Refurbished)"
    }, 
    {
        "reviews": [
            {
                "review_header": "AWFUL", 
                "review_text": "DO NOT BUY IT. I decided to buy this phone even though there were a lot of bad reviews and I fully regret. I bought this UNLOCKED phone and when I tried to put my SIM card in, it had no service. After taking it to 4 different tech places they told me the phone was LOCKED BY SPRINT. I am still trying to figure out what to do with it. Don't buy, it will just cause problems.", 
                "review_comment_count": "4", 
                "review_posted_date": "13 Oct 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Thanks for the STOLEN phone.", 
                "review_text": "The phone was in okay shape. Some dings around the camera area but it was marked STOLEN when we tried to activate it. Haven't been able to activate it yet but we will keep you posted.", 
                "review_comment_count": "3", 
                "review_posted_date": "18 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " B Lowr"
            }, 
            {
                "review_header": "No iphone", 
                "review_text": "I got this iPhone 6, open the box and there was the accesorios but no iphone. I'm very disappointed", 
                "review_comment_count": "8", 
                "review_posted_date": "21 Sep 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Referbished iPhone 6 64gb", 
                "review_text": "I purchased this Referbished from the seller ABC Direct. And I am blown away at the quality and customer service I received. The device itself is in perfect condition, no scratches, no dings, everything works as advertised. Looks and operates like a brand new device. And I can already assure all of you reading this that I will purchase from them again in the near future!", 
                "review_comment_count": "", 
                "review_posted_date": "17 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " CJ Slaughter"
            }, 
            {
                "review_header": "Verizon...REALLY?", 
                "review_text": "The good: Phone looks excellent. The bad (well, annoying, but not bad bad) Battery was completely dead but seems to be taking a charge. Won't be activating the phone (more on that) but I'm gonna let it charge and update this later. (Update...phone activated on Straight Talk and seems to be working properly) The ugly: I ordered \"Apple iPhone 6 16GB Factory Unlocked GSM (Certified Refurbished)\" that clearly states in the description: Factory unlocked iPhones are GSM models and are ONLY compatible with GSM carriers like AT&T and T-Mobile as well as other GSM networks around the world. They WILL NOT WORK with CDMA carriers like Sprint, Verizon and the likes. However...I just got the package and the phone has a \"Carrier VERIZON Model IPhone 6 sticker on the back! So....what exactly did I get? Have to wait and see...I emailed the seller (DealFisher) and am trying to research the MEID and IMEI. The model number for both is 1549 so that's not much help. Update: Apple says it's unlocked and not identified as lost/stolen or anything bad like that. DealFisher says it's unlocked too. Jury is still out on issues with Straight Talk and Verizon and traveling, but phone seems to work and is in great shape, battery seems to be holding, and seller responded and is willing to work with me if there are issues...updated to 4 stars.", 
                "review_comment_count": "", 
                "review_posted_date": "09 Feb 2017", 
                "review_rating": "4.0 ", 
                "review_author": " JJ"
            }, 
            {
                "review_header": "Battery is bad", 
                "review_text": "Phone has begun to die very quickly. I was just at 50%, looked back at my phone and am now at 15%. It also sometimes dies at 15%, much higher than when they are supposed to die at 1%. Thinking about contacting them to get a new one.", 
                "review_comment_count": "", 
                "review_posted_date": "09 Nov 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "No Regrets", 
                "review_text": "The bad reviews almost discouraged me from making the purchase but I still went ahead with it and today I must say I don't regret buying my phone here.... twas good for me!! 😊😊", 
                "review_comment_count": "", 
                "review_posted_date": "02 Jan 2017", 
                "review_rating": "4.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Just don't.", 
                "review_text": "My night started out with pure enthusiasm as I found out my iPhone arrived. Soon that enthusiasm would go away. The first problem with the phone started out small, but rather annoying, the mute button was defective. I would mearly breath on the phone, if even that and it would start toggling between mute and sound, all while buzzing. Annoying. Then I found out that the model of iPhone was originally from either Korea or Japan, making it so that I could not turn off the shutter sound when taking photos/snapshots, highly annoying. I looked through the packaging to find out there was a 90 day warranty and I just had to call/email to get ahold of the company to fix the issue. Simple, and helpful right? It would be if the company actually picked up the call or emailed you back. What a joke. I found out there are a couple work around a to these issues and I wasn't happy doing them, but I didn't want to be without a phone even for a couple days, (why I paid for this one to be over nighted to my dorm room, even though it ended up not able to be in my hands until two days after I was supposed to.) so I was going to keep it. Then it died at 40 some percent battery and now I'm going to just return it and never deal with magic mobile partners again. Ever. I would advise you and anyone else who asked me to do the same. Just when I thought I was going to actually like iPhones, probably will just buy a new one as I would suggest you do too if you want one.", 
                "review_comment_count": "", 
                "review_posted_date": "14 Feb 2017", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }
        ], 
        "ratings": {
            "2 star": "5%", 
            "1 star": "26%", 
            "4 star": "11%", 
            "3 star": "5%", 
            "5 star": "53%"
        }, 
        "price": "$299.99", 
        "url": "http://www.amazon.com/dp/B00YD546IA", 
        "name": "Apple iPhone 6 16GB Factory Unlocked GSM 4G LTE Smartphone, Silver (Certified Refurbished)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Trick!!!", 
                "review_text": "The guys from unlocked world have attach an other label with 128gb but the phone is 64gb! So be very careful when you pick up your order they may have made mistake or intentionally make it like that... I will not take anything from them anymore! P. S. The phone works excellent!!! But is 64gb and I pay for 128gb!!!!", 
                "review_comment_count": "4", 
                "review_posted_date": "08 Sep 2015", 
                "review_rating": "4.0 ", 
                "review_author": " Marcel Dobre"
            }, 
            {
                "review_header": "An Android User's Review of the iPhone 6: Read this if you are thinking of switching from Android!!!", 
                "review_text": "So I made the switch from using Android to the iPhone back in October, and I've been using the iPhone 6 for the past few months now and can give a detailed review on what it's like to switch over. Before this switch, I've used the Samsung Galaxy S2 (first smartphone ever!) and also the Nexus 4. Since I'm a tech enthusiast, I'm well versed and have played around with many other Android devices, including all the big names, Galaxy S5, HTC One M8 and M7, One Plus One, and so on. Here are my thoughts: Things that the iPhone does really well (both hardware and software-wise): 1. Camera. The behind the scene software for digitally capturing an image is definitely the strongest sell for the iPhone. Other than the S5 and Note 4, no smartphone really comes close to having the same kind of image quality (no matter the megapixels) compared to the iPhone. This was one of the reasons for me to switch over since I've started to dabble with photography and wanted a really good camera in my smartphone. (Side note, if you read a lot of tech blogs, there is a notion that in the near future our smartphones won't accurately describe our devices anymore since making a phone call is probably one of the least commonly used features on a smartphone when you look at any average user. Cameras, social media, emails all take a higher usage rate than making a call... really interesting, but anyway, back to the review). 2. Reliability. There have been maybe 2 or 3 times when my phone crashed and would have to be restarted, mostly due to playing some game that was not written very well for the iOS devices. On Android devices, I've experienced a lot more crashes, and that may be due to the fact that so many apps haven't figured out the best way to optimize the app for each individual phone due to the fragmentation problems or something else. Either way, I feel like the iOS environment and hardware is more reliable in my everyday use. 3. Fingerprint sensor. Once you've used it, you won't go back. The S5 is not that close yet in terms of usability with their sensor. The one in the iPhone 6 works really well. I definitely have found myself using my phone more because of how easy it is to unlock and install apps. 4. Control of apps. This is an interesting point. In general, you get way more control over how to use and how to integrate your apps on Android than iOS. But in iOS, it's really interesting that you can control the kind of notification that gets sent to your phone, background refresh, location requirement, and access to certain things like photos and camera. In Android, you can do all of this as well, but sometimes for a lot of apps you have to have root access. 5. Double tap to bring down the row of apps. I can't believe no one has thought of this before. A lot of Android phones have gigantic screens, but no one has really figured out how to best get the users to interact with that. You can tap the home button twice on the iPhone to bring down the top few rows of the apps so that you can access them in one hand use. Here are the things that I miss on Android: 1. Full integration of almost any apps and control of default apps. I can set default apps on Android whereas Apple does not allow that. I can open up photos and upload them to Dropbox or any other app that I choose to, whereas Apple doesn't allow uploading to Dropbox via the Photos app (you have to open up Dropbox, then select upload and then go to Photos from there). 2. Better email. In the mail app for Android, you can attach almost any file on the phone. You can't do that on Apple. You can't even attach a single file. You have to share a file as an email. So, forget about replying an email with an attachment. This is pretty annoying. 3. Productivity is better on Android. If you are a big dropbox user, you probably know and love Dropsync on Android (seriously, best 5 bucks spent on any app). You can have an app that syncs and download any material from Dropbox onto your Android and then sync it back up when changes are detected. It's so seamless. Apple does NOT allow that (mainly because they don't allow background apps from accessing the hard drive, or something along those lines). So you have to download the file you are interested in manually from the Dropbox app. It just slows you down a lot, especially if you get to a part of a building where there is weak signal for wifi or cellular data. 4. Notifications are way better. Why can't Apple make one button that clears all of your notifications? You have to individually close each app's own notification. I pretty much leave my notification screen untouched. 5. Some other things that many already know: Google Now is way better/useful than Siri. Material design looks awesome! Way better widgets and the fact that you can have widgets!! Oh, and you can swipe right on the home screen on Android and that brings another screen from the left side... can't do that on iOS, the home page is set to be the left most one. More customization and etc. Conclusion: Overall, I think the iPhone is a fine device to use and you probably won't regret investing in one. The customer service from Apple is top notch, even if their parts cost an arm and leg. I think that, and I hate to say this because it's going to sound like every blog writer out there, the choice really does come down to personal preference and what you use the phone for. So, I've broken down my recommendation based on user case scenarios: If you are user type... Workaholic, Students: Android will be the best option unless your company/job dictates that you use an iPhone. The integration with all the apps and the feature with dropbox is just so important to anyone who works on their phones and other mobile devices. I would either get a pure Google device (N5 or N6, I like smaller phones... so N5 is up there) or a Google Edition device, or the Moto X. Samsung and HTC are also good choices but updates may be slow. One Plus One is actually pretty cool. They are not the best when it comes to customer service since they're a small company filling huge demand, but from my experience, the device is solid and definitely a work horse. Medical and Science community: iPhone. Unfortunately, most of the med and science people rely on Apple products, and a lot of new apps still come to iOS first or are better updated and designed on iOS. Recreational, use a phone as a communication device and for fun: iPhone. The camera and social apps are fun to use on the iPhone. For older folks: This is a split. If you've used Apple products before, then iOS will be easy to learn. Android phones have gotten a LOT easier to use thanks to a big push from Google dealing with not only the UI from a software perspective but also from a design perspective. It is more intuitive than it used to be. Photographer, blogger, foodie: iPhone 6 still has the best selection of apps and arguably the best camera. Samsung's camera is great, but the company is known to really bog down their stellar devices with bloatware that ruins or significantly slows down your phone after 1 year of use. I love the HTC ONE in design, but their gamble on the cameras have not paid off for their customers or themselves. So was this the right switch for me? As I'm learning more about the iPhone and iOS, I've realized that when the two year is over or whenever this phone dies on me, I'll most likely switch back to Android. While I think I've been thoroughly spoiled by the fingerprint sensor, the productivity that I enjoyed on Android just doesn't replicate itself here on the iPhone. Maybe it's not meant to be a super productive machine, but I guess my main point is that I'd like to have that option available when I need it. Another side note: Most of the shortfalls of either Android and iOS can be bypassed via means of rooting, custom ROMs, and jailbreaking (in the case of iOS). And I do understand that a lot of people enjoy doing this and can get their phones to work fantastically well. I used to do a lot of customization and go through ROMs once every three days on my Android devices, but I've come to realize that I'd rather spend that time using the device than customizing it. So, nowadays, I just want my devices to work right out of the box. The little details like a great camera, fingerprint sensor, and the ability to have my dropbox synced on the go and a good notification system should all be there when I turn on my phone. Summary and TL; DR: So there you have it. An Android user's thoughts on using the iPhone 6. Do I have regrets switching over? After using my friend's One Plus One and seeing Material Design on my old N4, I definitely regret it. But for now, the iPhone 6 suits my needs, even if there are occasional frustration points. If you are an Android user, please consider all these points and google similar stories before switching. Also, I'm one of those workaholics and forever in search of super productivity, hence my review that I'd like to go back to Android. However, I know plenty of people who swear by their iPhones for productivity. If you are always connected and depend on a suite of iOS specific apps (including apps that are better designed or work better on iOS), then chances are you love the iPhone. There are plenty of things to like and love about either OS. It really does come down to personal preference. ***UPDATE 2/9/15: I got to try the new Outlook 2015 app by Microsoft, and it has alleviated a lot of the email/attachment issues that I have mentioned above. It allows you to sign into your Exchange, Outlook accounts as well as your Gmail, Yahoo, and iCloud emails. You can also integrate your OneDrive, GoogleDrive, Dropbox and Box accounts, and that's where the magic begins. Once integrated, you can attach any file located in those drives, which is great! You can also attach files that are attached in emails that are already in your inbox! And, you can now reply an email with the option of attaching a file. Finally, you can decide if you want to open up links from emails in Safari or another browser installed on your phone (so, you are no longer bound by default Apple apps). This is a huge step forward, and it's from Microsoft (a pleasant surprise). ***This app has really improved my productivity needs, since when considering the iPhone we have to take into account the hardware and the software/app ecosystem, i think this makes sense to bump up the rating to 4/5. There are still kinks when switching over if you are used to productive flexibility on Android phones, but right now the 3rd party apps are getting better and better at work-arounds. ***UPDATE 1/2/2017: The iPhone 6 has served me well over the past two years, but I've made the upgrade to the iPhone 7 a few months ago. If you are interested in reading about my thoughts on the iPhone 7, you can read my review here on Amazon https://www.amazon.com/review/R1WITRNVJL6ALR/ref=cm_cr_rdp_perm", 
                "review_comment_count": "50", 
                "review_posted_date": "28 Jan 2015", 
                "review_rating": "4.0 ", 
                "review_author": " Ja"
            }, 
            {
                "review_header": "DO NOT BUY FROM THIS SELLER!!", 
                "review_text": "BUYER BEWARE!! Opened the box and there was play doh instead of a phone!!", 
                "review_comment_count": "4", 
                "review_posted_date": "16 Nov 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Ms."
            }, 
            {
                "review_header": "FULL OF PLAY DOLL INSTEAD OF PHONE", 
                "review_text": "it was full of play doll! unbelievable!!! I spect my money back NOW!!!", 
                "review_comment_count": "3", 
                "review_posted_date": "20 Jul 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "I was fraud", 
                "review_text": "I was fraud until today the box was open and my surprise is that in the interior theres no phone buy only a clay. Si this a fraud o what need an answer", 
                "review_comment_count": "1", 
                "review_posted_date": "06 Aug 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "NO IPHONE IN BOX!", 
                "review_text": "Bought an iPhone 6s 128gb! I came in 2 days. I opened the box, NO IPHONE! It had everything else except the phone! Who would do this? Completely unacceptable. BE AWARE!", 
                "review_comment_count": "3", 
                "review_posted_date": "10 Jan 2016", 
                "review_rating": "1.0 ", 
                "review_author": " D. Ha"
            }, 
            {
                "review_header": "THIS PRODUCT IS NOT SOLD BUY APPLE!! IT ...", 
                "review_text": "THIS PRODUCT IS NOT SOLD BUY APPLE!! IT IS A SCAM!! IT DOESNT DESERVE ANY STARS! I BOUGHT THIS AND RECIEVED EVERYTHING BUT THE PHONE", 
                "review_comment_count": "5", 
                "review_posted_date": "12 Feb 2016", 
                "review_rating": "1.0 ", 
                "review_author": " S-M Newsome"
            }, 
            {
                "review_header": "Looking for a solution", 
                "review_text": "I bought this phone on January 2, It arrived 3-4 weeks later (as everything I order from amazon, I am in Honduras). As I received it the headphone jack was not working, when I plugged in the headphones the sound was very bad quality, I am not even able to enjoy a song (which is really important to me), but the sound that comes out of the iphone is good quality, just not able to listen through the headphone jack. The phone has always been in a lifeproof phone case, it has never been drop, I have not submerged into water and it is new. I was going to let go of the sound problem even though I was dissappointed; but on saturday the touch started giving me problems. Yesterday (sunday) I was not able to use my phone at all even though I restarted the phone several times to see if that would help, but it did not; even if it did work it would not last for more than 15 seconds. I left the phone alone for the rest of the day and today I turned it on, the touch works when it wants to (and if it does, it just last for some minutes if lucky) and stops whenever it decides. Right now I am not beeing able to use it. I got to the conclusion that the phone came with failures and maybe it is just my bad luck and the rest of the phones came out good but I really would like to know if there is something I could do about it because honestly I do really need it, and in this condition it is just a waste of money. Please contact me if you think I could send the phone back and get another that works properly. Thanks and bye!", 
                "review_comment_count": "", 
                "review_posted_date": "06 Feb 2017", 
                "review_rating": "1.0 ", 
                "review_author": " Valeria Martino"
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "16%", 
            "4 star": "10%", 
            "3 star": "5%", 
            "5 star": "65%"
        }, 
        "price": "$336.00", 
        "url": "http://www.amazon.com/dp/B00NQGP42Y", 
        "name": "Apple iPhone 6 16GB Factory Unlocked GSM 4G LTE Internal Smartphone - Space Gray"
    }, 
    {
        "reviews": [
            {
                "review_header": "AWFUL", 
                "review_text": "DO NOT BUY IT. I decided to buy this phone even though there were a lot of bad reviews and I fully regret. I bought this UNLOCKED phone and when I tried to put my SIM card in, it had no service. After taking it to 4 different tech places they told me the phone was LOCKED BY SPRINT. I am still trying to figure out what to do with it. Don't buy, it will just cause problems.", 
                "review_comment_count": "4", 
                "review_posted_date": "13 Oct 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Thanks for the STOLEN phone.", 
                "review_text": "The phone was in okay shape. Some dings around the camera area but it was marked STOLEN when we tried to activate it. Haven't been able to activate it yet but we will keep you posted.", 
                "review_comment_count": "3", 
                "review_posted_date": "18 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " B Lowr"
            }, 
            {
                "review_header": "No iphone", 
                "review_text": "I got this iPhone 6, open the box and there was the accesorios but no iphone. I'm very disappointed", 
                "review_comment_count": "8", 
                "review_posted_date": "21 Sep 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Referbished iPhone 6 64gb", 
                "review_text": "I purchased this Referbished from the seller ABC Direct. And I am blown away at the quality and customer service I received. The device itself is in perfect condition, no scratches, no dings, everything works as advertised. Looks and operates like a brand new device. And I can already assure all of you reading this that I will purchase from them again in the near future!", 
                "review_comment_count": "", 
                "review_posted_date": "17 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " CJ Slaughter"
            }, 
            {
                "review_header": "Verizon...REALLY?", 
                "review_text": "The good: Phone looks excellent. The bad (well, annoying, but not bad bad) Battery was completely dead but seems to be taking a charge. Won't be activating the phone (more on that) but I'm gonna let it charge and update this later. (Update...phone activated on Straight Talk and seems to be working properly) The ugly: I ordered \"Apple iPhone 6 16GB Factory Unlocked GSM (Certified Refurbished)\" that clearly states in the description: Factory unlocked iPhones are GSM models and are ONLY compatible with GSM carriers like AT&T and T-Mobile as well as other GSM networks around the world. They WILL NOT WORK with CDMA carriers like Sprint, Verizon and the likes. However...I just got the package and the phone has a \"Carrier VERIZON Model IPhone 6 sticker on the back! So....what exactly did I get? Have to wait and see...I emailed the seller (DealFisher) and am trying to research the MEID and IMEI. The model number for both is 1549 so that's not much help. Update: Apple says it's unlocked and not identified as lost/stolen or anything bad like that. DealFisher says it's unlocked too. Jury is still out on issues with Straight Talk and Verizon and traveling, but phone seems to work and is in great shape, battery seems to be holding, and seller responded and is willing to work with me if there are issues...updated to 4 stars.", 
                "review_comment_count": "", 
                "review_posted_date": "09 Feb 2017", 
                "review_rating": "4.0 ", 
                "review_author": " JJ"
            }, 
            {
                "review_header": "Battery is bad", 
                "review_text": "Phone has begun to die very quickly. I was just at 50%, looked back at my phone and am now at 15%. It also sometimes dies at 15%, much higher than when they are supposed to die at 1%. Thinking about contacting them to get a new one.", 
                "review_comment_count": "", 
                "review_posted_date": "09 Nov 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "No Regrets", 
                "review_text": "The bad reviews almost discouraged me from making the purchase but I still went ahead with it and today I must say I don't regret buying my phone here.... twas good for me!! 😊😊", 
                "review_comment_count": "", 
                "review_posted_date": "02 Jan 2017", 
                "review_rating": "4.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Just don't.", 
                "review_text": "My night started out with pure enthusiasm as I found out my iPhone arrived. Soon that enthusiasm would go away. The first problem with the phone started out small, but rather annoying, the mute button was defective. I would mearly breath on the phone, if even that and it would start toggling between mute and sound, all while buzzing. Annoying. Then I found out that the model of iPhone was originally from either Korea or Japan, making it so that I could not turn off the shutter sound when taking photos/snapshots, highly annoying. I looked through the packaging to find out there was a 90 day warranty and I just had to call/email to get ahold of the company to fix the issue. Simple, and helpful right? It would be if the company actually picked up the call or emailed you back. What a joke. I found out there are a couple work around a to these issues and I wasn't happy doing them, but I didn't want to be without a phone even for a couple days, (why I paid for this one to be over nighted to my dorm room, even though it ended up not able to be in my hands until two days after I was supposed to.) so I was going to keep it. Then it died at 40 some percent battery and now I'm going to just return it and never deal with magic mobile partners again. Ever. I would advise you and anyone else who asked me to do the same. Just when I thought I was going to actually like iPhones, probably will just buy a new one as I would suggest you do too if you want one.", 
                "review_comment_count": "", 
                "review_posted_date": "14 Feb 2017", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }
        ], 
        "ratings": {
            "2 star": "5%", 
            "1 star": "26%", 
            "4 star": "11%", 
            "3 star": "5%", 
            "5 star": "53%"
        }, 
        "price": "$323.31", 
        "url": "http://www.amazon.com/dp/B00YD54AYU", 
        "name": "Apple iPhone 6 64GB Unlocked GSM Smartphone - Space Gray (Certified Refurbished)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Not satisfied at all", 
                "review_text": "the co. Breed and others should let buyers know about this 10% re-stocking fee and any other hidden fees for returning items. Not satisfied at all.", 
                "review_comment_count": "", 
                "review_posted_date": "17 Sep 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Mar"
            }, 
            {
                "review_header": "I am incredibly disappointed.", 
                "review_text": "Screen scratched in several places Home button difficult to press and clicks as if it is not attached just so Screen is dim but will not know if the brightness can be adjusted until the recipient of the gift inserts a SIM card and gains access to the phone Unfortunately, I am incredibly disappointed.", 
                "review_comment_count": "", 
                "review_posted_date": "12 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " DEVIN AUSTIN"
            }, 
            {
                "review_header": "Refurbished? Can't tell from where I am standing", 
                "review_text": "This seller ships amazing refurbished iPhones. Don't hesitate to get if you are in the market for one or more. I purchased 4, all came exactly as described and looked brand new. I bought some via eBay and was sorely disappointed but will only be looking for refurbished through amazon sellers in the future.", 
                "review_comment_count": "", 
                "review_posted_date": "30 Dec 2016", 
                "review_rating": "5.0 ", 
                "review_author": " UPS Brown"
            }, 
            {
                "review_header": "Phone did not work at all. It would only ...", 
                "review_text": "Phone did not work at all. It would only have power if it was plugged into a charger. It would shut off randomly, even when fully charged.", 
                "review_comment_count": "", 
                "review_posted_date": "12 Nov 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "This piece of garbage doesn't even deserve one star", 
                "review_text": "This piece of garbage doesn't even deserve one star. this phone is a scheme do NOT buy them. as soon as I turned on the phone a few second later the screen started flickering and it would not turn off. I strongly DON'T recommend this to you guys. Dont waste you your time; actually, im wasting my time right typing this review. this was a slap to the face.", 
                "review_comment_count": "", 
                "review_posted_date": "16 Feb 2017", 
                "review_rating": "1.0 ", 
                "review_author": " Hubenson Astreide"
            }, 
            {
                "review_header": "Broken phone and no response from seller", 
                "review_text": "DO NOT BUY FROM THIS SELLER. The phone isn't \"refurbished\"- it's broken and unusable. I like the look and feel of the phone, but it has *many* issues. I was upgrading from a 5s and the 6 seems like a great pick, but this seller clearly is just turning over broken phones and not doing the whole \"refurbishing\" part... The first issue is that applications keep crashing while I’m using it. This isn’t constant, but it’s happened multiple times, with various games/browsers, so I don’t like that. Another thing that’s even more annoying is that the volume doesn’t switch off. It pops back up to full volume immediately, or on its own randomly. Even when it IS in the mute position, the phone makes noise when getting texts, or taking a photo. I stopped by the Apple store to make sure I wasn’t confused and the Genius Bar woman was concerned and confused as well. She said if the volume is switched to off, the camera shutter should *not* make noise, yet it does. This is a nightmare at work when getting emails and texts. It's very loud and annoying, and this is embarrassing. It doesn’t stay in the mute position, it constantly slides back up. But even while it’s still in the mute position, it doesn’t mute the sounds. There is a new problem as of today, which is that it keeps saying my sent texts are undelivered, with the red exclamation, but then people respond to them. So I never know if something went through or not. The final thing that’s been “off” is that the screen sometimes gets wavy, which I’ve never experienced before in a phone. The first time this happened I was taking a photo through a window, so I didn’t think about it much and just assumed it was something to do with the glass. But it’s happened a few times now, while I’m texting, or on Facebook. I don’t even know why it would do this I was expecting a used but perfect condition phone. This one clearly has some issues, and it’s not functioning as promised.", 
                "review_comment_count": "", 
                "review_posted_date": "25 Jan 2017", 
                "review_rating": "1.0 ", 
                "review_author": " laura burnham"
            }, 
            {
                "review_header": "One Star", 
                "review_text": "It arrived with a cracked screen", 
                "review_comment_count": "", 
                "review_posted_date": "07 Sep 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Daniel A Grand"
            }, 
            {
                "review_header": "Generally fine except that the battery life is way too short", 
                "review_text": "Generally fine except that the battery life is way too short. Needs to be charged more than once a day, which is simply unacceptable.", 
                "review_comment_count": "", 
                "review_posted_date": "17 Aug 2016", 
                "review_rating": "4.0 ", 
                "review_author": " Michael Whitcomb"
            }
        ], 
        "ratings": {
            "2 star": "2%", 
            "1 star": "36%", 
            "4 star": "9%", 
            "3 star": "6%", 
            "5 star": "47%"
        }, 
        "price": "$349.99", 
        "url": "http://www.amazon.com/dp/B00YD54DV0", 
        "name": "Apple iPhone 6 128GB Factory Unlocked GSM 4G LTE Smartphone, Silver (Certified Refurbished)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Be careful before buying", 
                "review_text": "When you read it, you think it is a certified refurbished by Apple and would come in the manufacturer packaging. But it is certified by 3rd party whose refurbishment work is way worse than buying conventional used smart phone. Vibration is not working, WiFi is not detecting easily. Please note that I have received the product unlike described. Although it says \"Incl. all original accessories\", it actually came with a low quality charger and USB cable. Also there was no headphone. Please check the attached photo of the package as received !!!", 
                "review_comment_count": "", 
                "review_posted_date": "21 Nov 2015", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Needs a PIN number", 
                "review_text": "THESE PHONES ARE NOT UNLOCKED! DO NOT WASTE YOUR MONEY.", 
                "review_comment_count": "1", 
                "review_posted_date": "16 Dec 2015", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Phone barely worked for 3 days", 
                "review_text": "Received it looking like it had been thrown in a box (with fake cable and plug). Phone doesn't work at all in only 3 days. Returning it.", 
                "review_comment_count": "1", 
                "review_posted_date": "04 Oct 2015", 
                "review_rating": "1.0 ", 
                "review_author": " Michelle Rahn"
            }, 
            {
                "review_header": "this phone did not work correctly. it constantly buzzed ...", 
                "review_text": "this phone did not work correctly. it constantly buzzed when i was on calls and no one could hear me.", 
                "review_comment_count": "", 
                "review_posted_date": "22 Aug 2015", 
                "review_rating": "1.0 ", 
                "review_author": " Corinne McNamara"
            }, 
            {
                "review_header": "Battery will not charge", 
                "review_text": "This product has not been fully refurbished as claimed by the seller. The battery will not hold a charge or charge now. after being placed on the charger all night it will say 100% for a mi ute then drop immediately to below 50%.", 
                "review_comment_count": "1", 
                "review_posted_date": "05 Dec 2015", 
                "review_rating": "1.0 ", 
                "review_author": " John Hieronymus"
            }, 
            {
                "review_header": "Phone is not GSM compatible", 
                "review_text": "This phone is not compatible with GSM cellular network (e.g. AT&T), despite being advertised as such. Thus, when I got the phone and brought it to the AT&T store, I was told that it was in fact not GSM compatible. This phone is not damaged, but it does not work as described. The assistant at the AT&T store looked at the identifying information and identified it as a Verizon phone, and was unable to configure it to work with AT&T's network.", 
                "review_comment_count": "10", 
                "review_posted_date": "20 Aug 2015", 
                "review_rating": "1.0 ", 
                "review_author": " Chris Robotham"
            }, 
            {
                "review_header": "The battery is extremely short lived. It will show ...", 
                "review_text": "The battery is extremely short lived. It will show over 50% charged and then die. I have to almost constantly have this charging. I ran into issues getting my carriers cellular network. Not worth it for the price that was paid for a refurbished phone.", 
                "review_comment_count": "", 
                "review_posted_date": "24 Aug 2015", 
                "review_rating": "1.0 ", 
                "review_author": " Kyla Mattson"
            }, 
            {
                "review_header": "It did not work. It would not keep a ...", 
                "review_text": "It did not work. It would not keep a password. I changed my apple password 6 times. I took the phone to tmobile they couldn't figure it out they told me to take it to apple. They couldn't get it to remember a password either. I sent back last Monday.", 
                "review_comment_count": "", 
                "review_posted_date": "19 Jun 2015", 
                "review_rating": "1.0 ", 
                "review_author": " wendy mataya"
            }
        ], 
        "ratings": {
            "2 star": "9%", 
            "1 star": "37%", 
            "4 star": "11%", 
            "3 star": "8%", 
            "5 star": "35%"
        }, 
        "price": "$169.86", 
        "url": "http://www.amazon.com/dp/B00WZR5ULU", 
        "name": "Apple iPhone 5 16GB - Unlocked - White (Certified Refurbished)"
    }, 
    {
        "asin": "B01D1VHV56", 
        "error": "failed to process the page"
    }, 
    {
        "reviews": [
            {
                "review_header": "AWFUL", 
                "review_text": "DO NOT BUY IT. I decided to buy this phone even though there were a lot of bad reviews and I fully regret. I bought this UNLOCKED phone and when I tried to put my SIM card in, it had no service. After taking it to 4 different tech places they told me the phone was LOCKED BY SPRINT. I am still trying to figure out what to do with it. Don't buy, it will just cause problems.", 
                "review_comment_count": "4", 
                "review_posted_date": "13 Oct 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Thanks for the STOLEN phone.", 
                "review_text": "The phone was in okay shape. Some dings around the camera area but it was marked STOLEN when we tried to activate it. Haven't been able to activate it yet but we will keep you posted.", 
                "review_comment_count": "3", 
                "review_posted_date": "18 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " B Lowr"
            }, 
            {
                "review_header": "No iphone", 
                "review_text": "I got this iPhone 6, open the box and there was the accesorios but no iphone. I'm very disappointed", 
                "review_comment_count": "8", 
                "review_posted_date": "21 Sep 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Referbished iPhone 6 64gb", 
                "review_text": "I purchased this Referbished from the seller ABC Direct. And I am blown away at the quality and customer service I received. The device itself is in perfect condition, no scratches, no dings, everything works as advertised. Looks and operates like a brand new device. And I can already assure all of you reading this that I will purchase from them again in the near future!", 
                "review_comment_count": "", 
                "review_posted_date": "17 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " CJ Slaughter"
            }, 
            {
                "review_header": "Verizon...REALLY?", 
                "review_text": "The good: Phone looks excellent. The bad (well, annoying, but not bad bad) Battery was completely dead but seems to be taking a charge. Won't be activating the phone (more on that) but I'm gonna let it charge and update this later. (Update...phone activated on Straight Talk and seems to be working properly) The ugly: I ordered \"Apple iPhone 6 16GB Factory Unlocked GSM (Certified Refurbished)\" that clearly states in the description: Factory unlocked iPhones are GSM models and are ONLY compatible with GSM carriers like AT&T and T-Mobile as well as other GSM networks around the world. They WILL NOT WORK with CDMA carriers like Sprint, Verizon and the likes. However...I just got the package and the phone has a \"Carrier VERIZON Model IPhone 6 sticker on the back! So....what exactly did I get? Have to wait and see...I emailed the seller (DealFisher) and am trying to research the MEID and IMEI. The model number for both is 1549 so that's not much help. Update: Apple says it's unlocked and not identified as lost/stolen or anything bad like that. DealFisher says it's unlocked too. Jury is still out on issues with Straight Talk and Verizon and traveling, but phone seems to work and is in great shape, battery seems to be holding, and seller responded and is willing to work with me if there are issues...updated to 4 stars.", 
                "review_comment_count": "", 
                "review_posted_date": "09 Feb 2017", 
                "review_rating": "4.0 ", 
                "review_author": " JJ"
            }, 
            {
                "review_header": "Battery is bad", 
                "review_text": "Phone has begun to die very quickly. I was just at 50%, looked back at my phone and am now at 15%. It also sometimes dies at 15%, much higher than when they are supposed to die at 1%. Thinking about contacting them to get a new one.", 
                "review_comment_count": "", 
                "review_posted_date": "09 Nov 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "No Regrets", 
                "review_text": "The bad reviews almost discouraged me from making the purchase but I still went ahead with it and today I must say I don't regret buying my phone here.... twas good for me!! 😊😊", 
                "review_comment_count": "", 
                "review_posted_date": "02 Jan 2017", 
                "review_rating": "4.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Just don't.", 
                "review_text": "My night started out with pure enthusiasm as I found out my iPhone arrived. Soon that enthusiasm would go away. The first problem with the phone started out small, but rather annoying, the mute button was defective. I would mearly breath on the phone, if even that and it would start toggling between mute and sound, all while buzzing. Annoying. Then I found out that the model of iPhone was originally from either Korea or Japan, making it so that I could not turn off the shutter sound when taking photos/snapshots, highly annoying. I looked through the packaging to find out there was a 90 day warranty and I just had to call/email to get ahold of the company to fix the issue. Simple, and helpful right? It would be if the company actually picked up the call or emailed you back. What a joke. I found out there are a couple work around a to these issues and I wasn't happy doing them, but I didn't want to be without a phone even for a couple days, (why I paid for this one to be over nighted to my dorm room, even though it ended up not able to be in my hands until two days after I was supposed to.) so I was going to keep it. Then it died at 40 some percent battery and now I'm going to just return it and never deal with magic mobile partners again. Ever. I would advise you and anyone else who asked me to do the same. Just when I thought I was going to actually like iPhones, probably will just buy a new one as I would suggest you do too if you want one.", 
                "review_comment_count": "", 
                "review_posted_date": "14 Feb 2017", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }
        ], 
        "ratings": {
            "2 star": "5%", 
            "1 star": "26%", 
            "4 star": "11%", 
            "3 star": "5%", 
            "5 star": "53%"
        }, 
        "price": "$334.99", 
        "url": "http://www.amazon.com/dp/B00YD549VE", 
        "name": "Apple iPhone 6 64GB Factory Unlocked GSM 4G LTE Smartphone, Silver (Certified Refurbished)"
    }, 
    {
        "reviews": [
            {
                "review_header": "... GB I got it today and it was very nice. no iCloud account on it or anything", 
                "review_text": "The IPhone 6Plus Gold 64 GB I got it today and it was very nice. no iCloud account on it or anything. phone works great no errors . no scratches. only thing is there is a scratch on the bottom next to the headphone jack. like it was hit on a rock. I believe the old owner sold this phone because of this. lol. phone screen 0 scratches. as well screen works fine and apps works as well its unlocked. mummy the charger that came with the phone was not the original and no headphones and the original box too not there. Just a note to you guys. who ever got the phone on bad terms I did read and was scared a bit. I believe your stories. I guess its about luck who gets it 100% good shape or bad. mine is 99% only that scratch that nobody can see. this my first day using it. hope in the next few days wouldn't have a problem.", 
                "review_comment_count": "", 
                "review_posted_date": "19 Jan 2017", 
                "review_rating": "4.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "The phone was in perfect condition and had no problems setting the phone up with straight talk.", 
                "review_comment_count": "2", 
                "review_posted_date": "04 Dec 2015", 
                "review_rating": "5.0 ", 
                "review_author": " chica"
            }, 
            {
                "review_header": "Great phone", 
                "review_text": "Outstanding phone. Easy to set up. Watched a video on YouTube that was great. Phone works like a champ. Moved my wife's iTunes account to it. Yes the phone was for her birthday. Now both grown son's want one. Brother-in-law got one but not the plus,.", 
                "review_comment_count": "", 
                "review_posted_date": "05 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Charles Davis"
            }, 
            {
                "review_header": "NOT Recommend!!!!!!", 
                "review_text": "I would NOT recommend. The camera cliches. I was skeptical because of other review but wanted to save a few $. Should have trusted recent reviews. I also tried to message company through Amazon but did not receive a response. Going to return.", 
                "review_comment_count": "", 
                "review_posted_date": "13 Jan 2017", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Simply Awesome.", 
                "review_text": "When looking for a backup IPhone I stumbled upon this attractive deal on Amazon. Reading the reviews did raise a little bit of concern. I pulled the trigger and made the purchase. The day it was delivered I received a small white box with a generic charger and cable. Looking the phone over everything was in perfect condition. On the top of the device was a small nick above the flash. It's a Verizon unlocked 128gb. I'm using on T-Mobile with great service. No scratches on the screen or any sign of bendgate. Cast your worries aside. For the price and quality you can't pass up this phone. Thank you to the seller for a great experience.", 
                "review_comment_count": "1", 
                "review_posted_date": "11 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Robert Bitter"
            }, 
            {
                "review_header": "Item worked fine until day 68", 
                "review_text": "Item worked fine until day 68. Touch screen is unresponsive, never dropped, no water damage or anything else. Tried restarting/ resetting phone and it still is not resolved/ Attempting to contact seller to resolve issue.", 
                "review_comment_count": "", 
                "review_posted_date": "22 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Travis Holdsworth"
            }, 
            {
                "review_header": "and the screen was perfect! Don't be nervous or have any doubts", 
                "review_text": "I'm not the kind to review much, but it was the most expensive thing I have bought on Amazon and wanted to put a review. I had my phone stolen and I couldn't get it replaced by the insurance company, so I decided to go on Amazon and try buying an iPhone. I was a little sketchy about it, but I really wanted it so I decided to do it. My phone came in on time, the phone looks brand new, and the screen was perfect! Don't be nervous or have any doubts, I'm really happy with what I got. It's totally worth it. It looks so new that's it hard to believe someone before me owned it. It doesn't bring a SIM card, but if you already have one then your set. Don't think twice, just do it trust me!! Thanks guys!!", 
                "review_comment_count": "", 
                "review_posted_date": "21 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Probably the best phone you can buy for this price", 
                "review_text": "I've had my phone for almost a week now and I'm still obsessed with it! I'm highly pleased with the quality of this phone. It looks brand new and functions perfectly. I'm writing this review with it right now lol I would highly recommend this seller to anyone!", 
                "review_comment_count": "", 
                "review_posted_date": "05 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }
        ], 
        "ratings": {
            "2 star": "6%", 
            "1 star": "28%", 
            "4 star": "9%", 
            "3 star": "5%", 
            "5 star": "52%"
        }, 
        "price": "$399.99", 
        "url": "http://www.amazon.com/dp/B00YD54N24", 
        "name": "Apple iPhone 6 Plus Space Gray 64GB Unlocked Smartphone (Certified Refurbished)"
    }
]